PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_mipidsi.h
/***************************************************************************//**
* \file cy_mipidsi.h
* \version 1.0
*
* This file provides constants and parameter values for the APIs provided
* by MIPI DSI.
*
********************************************************************************
* \copyright
* Copyright 2021 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*
*******************************************************************************/

/**
* \addtogroup group_mipidsi            MIPI DSI     (MIPI Display Serial Interface)
* \{
*
* MIPI DSI driver provides an application interface for configuring MIPI DSI IP Block.
*
* MIPI-DSI Host Controller and D-PHY (MIPIDSI) features
* - DPI-2 and and DBI-2 Type B displays.
* - Up to 2 data lanes, max 1.5 Gbps per lane.
* - PLL for high-speed mode clock generation.
* - Generic command interface (DCS and proprietary read & write).
* - Video Pattern generator.
* - Ultra-Low-Power mode with disabled PLL.
* - Tearing Effect interrupt for DBI displays.
* - Shutdown and Color Mode control for DPI displays.

* The functions and other declarations used in this driver are in cy_mipidsi.h.
* You can include cy_pdl.h to get access to all functions
* and declarations in the PDL.
*
* \section group_mipidsi_section_more_information More Information
*
* For more information on the MIPI DSI and Graphics subsystem, refer to the technical reference
* manual (TRM).
*
* \section group_mipidsi_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial Driver.</td>
*     <td>Initial Driver.</td>
*   </tr>
*   </tr>
* </table>
*
* \defgroup group_mipidsi_macros Macros
* \defgroup group_mipidsi_functions Functions
* \defgroup group_mipidsi_data_structures Data Structures
* \defgroup group_mipidsi_enums Enumerated Types
*/

#if !defined (CY_MIPIDSI_H)
#define CY_MIPIDSI_H

#include "cy_device.h"

#if defined (CY_IP_MXS22GFXSS)

#include "cy_syspm.h"

#if defined(__cplusplus)
extern "C" {
#endif

/**
* \addtogroup group_mipidsi_macros
* \{
*/

/**
* \defgroup group_mipidsi_version_macros Version Macros
* \{
*/

/** Graphics driver identifier */
#define CY_MIPIDSI_ID                                   (CY_PDL_DRV_ID(0x4EU))

/** Driver major version */
#define CY_MIPIDSI_DRV_VERSION_MAJOR                    1

/** Driver minor version */
#define CY_MIPIDSI_DRV_VERSION_MINOR                    0

/** \} group_mipidsi_version_macros */

/**
* \defgroup group_mipidsi_mode_macros Mode Flags
* \{
*/

/** Video Mode Non Burst Sync Pulses */
#define VID_MODE_TYPE_NON_BURST_SYNC_PULSES                0x0UL
/** Video Mode Non Burst Sync Events */
#define VID_MODE_TYPE_NON_BURST_SYNC_EVENTS                0x1UL
/** Video Mode Burst */
#define VID_MODE_TYPE_BURST                                0x2UL
/** Video mode mask */
#define VID_MODE_TYPE_MASK                                 0x3

/** BIT definition */
#define BIT(x)                                            (1UL << (x))

/** video mode */
#define MIPI_DSI_MODE_VIDEO        BIT(0)
/** video burst mode */
#define MIPI_DSI_MODE_VIDEO_BURST    BIT(1)
/** video pulse mode */
#define MIPI_DSI_MODE_VIDEO_SYNC_PULSE    BIT(2)
/** enable auto vertical count mode */
#define MIPI_DSI_MODE_VIDEO_AUTO_VERT    BIT(3)
/** enable hsync-end packets in vsync-pulse and v-porch area */
#define MIPI_DSI_MODE_VIDEO_HSE        BIT(4)
/** disable hfront-porch area */
#define MIPI_DSI_MODE_VIDEO_NO_HFP    BIT(5)
/** disable hback-porch area */
#define MIPI_DSI_MODE_VIDEO_NO_HBP    BIT(6)
/** disable hsync-active area */
#define MIPI_DSI_MODE_VIDEO_NO_HSA    BIT(7)
/** flush display FIFO on vsync pulse */
#define MIPI_DSI_MODE_VSYNC_FLUSH    BIT(8)
/** disable EoT packets in HS mode */
#define MIPI_DSI_MODE_NO_EOT_PACKET    BIT(9)
/** device supports non-continuous clock behavior (DSI spec 5.6.1) */
#define MIPI_DSI_CLOCK_NON_CONTINUOUS    BIT(10)
/** transmit data in low power */
#define MIPI_DSI_MODE_LPM        BIT(11)
/** Allow low power transmission during video transfer */
#define ENABLE_LOW_POWER        (0x3FUL << 8)
/** Enable command transmission only in Low Power mode */
#define ENABLE_LOW_POWER_CMD        BIT(15)

/** \} group_mipidsi_mode_macros */

/**
* \defgroup group_mipidsi_display_polarity_macros Display Parameter Flags
* \{
*/
/** Display parameter polarity flags - Positive HSYNC */
#define DISPLAY_PARAMS_FLAG_PHSYNC            (1U<<0)
/** Display parameter polarity flags - Negative HSYNC */
#define DISPLAY_PARAMS_FLAG_NHSYNC            (1U<<1)
/** Display parameter polarity flags - Positive VSYNC */
#define DISPLAY_PARAMS_FLAG_PVSYNC            (1U<<2)
/** Display parameter polarity flags - Negative VSYNC */
#define DISPLAY_PARAMS_FLAG_NVSYNC            (1U<<3)
/** \} group_mipidsi_display_polarity_macros */

/**
* \defgroup group_mipidsi_intr_mask_macros Interrupt Mask Macros
* \{
*/

/** Interrupt from MIPI DSI CORE. */
#define MIPIDSI_CORE_INTERRUPT_MASK            (1U<<0)

/** Command transmission error occurred in DPI mode. */
#define MIPIDSI_DPI_HALT_INTERRUPT_MASK        (1U<<16)

/** Tearing Effect interrupt by display in DBI mode. */
#define MIPIDSI_DBI_TE_INTERRUPT_MASK          (1U<<8)

/** \} group_mipidsi_intr_mask_macros */

/** \} group_mipidsi_macros */

/*******************************************************************************
*       Enumerated Types
*******************************************************************************/

/**
* \addtogroup group_mipidsi_enums
* \{
*/

/** MIPI DSI API result */
typedef enum
{
    CY_MIPIDSI_SUCCESS,          /**< Success */
    CY_MIPIDSI_BAD_PARAM,        /**< Bad parameter */
    CY_MIPIDSI_TIMEOUT,          /**< Operation timeout */
} cy_en_mipidsi_status_t;

/** DPI/DBI interface pixel color format */
typedef enum
{
    CY_MIPIDSI_FMT_8BIT_8BPP,
    CY_MIPIDSI_FMT_8BIT_12BPP,
    CY_MIPIDSI_FMT_8BIT_16BPP,
    CY_MIPIDSI_FMT_8BIT_18BPP,
    CY_MIPIDSI_FMT_8BIT_24BPP,
    CY_MIPIDSI_FMT_9BIT_18BPP,
    CY_MIPIDSI_FMT_16BIT_8BPP,
    CY_MIPIDSI_FMT_16BIT_12BPP,
    CY_MIPIDSI_FMT_16BIT_16BPP,
    CY_MIPIDSI_FMT_16BIT_18BPP_OP1,
    CY_MIPIDSI_FMT_16BIT_18BPP_OP2,
    CY_MIPIDSI_FMT_16BIT_24BPP_OP1,
    CY_MIPIDSI_FMT_16BIT_24BPP_OP2,
    CY_MIPIDSI_FMT_RGB888,
    CY_MIPIDSI_FMT_RGB666,
    CY_MIPIDSI_FMT_RGB666_PACKED,
    CY_MIPIDSI_FMT_RGB565
} cy_en_mipidsi_pixel_format_t;

