PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_mipidsi.h
/** MIPI DSI Packet Type */
typedef enum
{
    MIPI_DSI_V_SYNC_START = 0x01,
    MIPI_DSI_V_SYNC_END = 0x11,
    MIPI_DSI_H_SYNC_START = 0x21,
    MIPI_DSI_H_SYNC_END = 0x31,
    MIPI_DSI_COLOR_MODE_OFF = 0x02,
    MIPI_DSI_COLOR_MODE_ON = 0x12,
    MIPI_DSI_SHUTDOWN_PERIPHERAL = 0x22,
    MIPI_DSI_TURN_ON_PERIPHERAL = 0x32,
    MIPI_DSI_GENERIC_SHORT_WRITE_0_PARAM = 0x03,
    MIPI_DSI_GENERIC_SHORT_WRITE_1_PARAM = 0x13,
    MIPI_DSI_GENERIC_SHORT_WRITE_2_PARAM = 0x23,
    MIPI_DSI_GENERIC_READ_REQUEST_0_PARAM = 0x04,
    MIPI_DSI_GENERIC_READ_REQUEST_1_PARAM = 0x14,
    MIPI_DSI_GENERIC_READ_REQUEST_2_PARAM = 0x24,
    MIPI_DSI_DCS_SHORT_WRITE = 0x05,
    MIPI_DSI_DCS_SHORT_WRITE_PARAM = 0x15,
    MIPI_DSI_DCS_READ = 0x06,
    MIPI_DSI_SET_MAXIMUM_RETURN_PACKET_SIZE = 0x37,
    MIPI_DSI_END_OF_TRANSMISSION = 0x08,
    MIPI_DSI_NULL_PACKET = 0x09,
    MIPI_DSI_BLANKING_PACKET = 0x19,
    MIPI_DSI_GENERIC_LONG_WRITE = 0x29,
    MIPI_DSI_DCS_LONG_WRITE = 0x39,
    MIPI_DSI_LOOSELY_PACKED_PIXEL_STREAM_YCBCR20 = 0x0c,
    MIPI_DSI_PACKED_PIXEL_STREAM_YCBCR24 = 0x1c,
    MIPI_DSI_PACKED_PIXEL_STREAM_YCBCR16 = 0x2c,
    MIPI_DSI_PACKED_PIXEL_STREAM_30 = 0x0d,
    MIPI_DSI_PACKED_PIXEL_STREAM_36 = 0x1d,
    MIPI_DSI_PACKED_PIXEL_STREAM_YCBCR12 = 0x3d,
    MIPI_DSI_PACKED_PIXEL_STREAM_16 = 0x0e,
    MIPI_DSI_PACKED_PIXEL_STREAM_18 = 0x1e,
    MIPI_DSI_PIXEL_STREAM_3BYTE_18 = 0x2e,
    MIPI_DSI_PACKED_PIXEL_STREAM_24 = 0x3e
} cy_en_mipidsi_packet_type_t;

/** MIPI DCS commands */
typedef enum
{
    MIPI_DCS_NOP            = 0x00,
    MIPI_DCS_SOFT_RESET        = 0x01,
    MIPI_DCS_GET_COMPRESSION_MODE    = 0x03,
    MIPI_DCS_GET_DISPLAY_ID        = 0x04,
    MIPI_DCS_GET_ERROR_COUNT_ON_DSI    = 0x05,
    MIPI_DCS_GET_RED_CHANNEL    = 0x06,
    MIPI_DCS_GET_GREEN_CHANNEL    = 0x07,
    MIPI_DCS_GET_BLUE_CHANNEL    = 0x08,
    MIPI_DCS_GET_DISPLAY_STATUS    = 0x09,
    MIPI_DCS_GET_POWER_MODE        = 0x0A,
    MIPI_DCS_GET_ADDRESS_MODE    = 0x0B,
    MIPI_DCS_GET_PIXEL_FORMAT    = 0x0C,
    MIPI_DCS_GET_DISPLAY_MODE    = 0x0D,
    MIPI_DCS_GET_SIGNAL_MODE    = 0x0E,
    MIPI_DCS_GET_DIAGNOSTIC_RESULT    = 0x0F,
    MIPI_DCS_ENTER_SLEEP_MODE    = 0x10,
    MIPI_DCS_EXIT_SLEEP_MODE    = 0x11,
    MIPI_DCS_ENTER_PARTIAL_MODE    = 0x12,
    MIPI_DCS_ENTER_NORMAL_MODE    = 0x13,
    MIPI_DCS_GET_IMAGE_CHECKSUM_RGB    = 0x14,
    MIPI_DCS_GET_IMAGE_CHECKSUM_CT    = 0x15,
    MIPI_DCS_EXIT_INVERT_MODE    = 0x20,
    MIPI_DCS_ENTER_INVERT_MODE    = 0x21,
    MIPI_DCS_SET_GAMMA_CURVE    = 0x26,
    MIPI_DCS_SET_DISPLAY_OFF    = 0x28,
    MIPI_DCS_SET_DISPLAY_ON        = 0x29,
    MIPI_DCS_SET_COLUMN_ADDRESS    = 0x2A,
    MIPI_DCS_SET_PAGE_ADDRESS    = 0x2B,
    MIPI_DCS_WRITE_MEMORY_START    = 0x2C,
    MIPI_DCS_WRITE_LUT        = 0x2D,
    MIPI_DCS_READ_MEMORY_START    = 0x2E,
    MIPI_DCS_SET_PARTIAL_ROWS    = 0x30,        /* MIPI DCS 1.02 - MIPI_DCS_SET_PARTIAL_AREA before that */
    MIPI_DCS_SET_PARTIAL_COLUMNS    = 0x31,
    MIPI_DCS_SET_SCROLL_AREA    = 0x33,
    MIPI_DCS_SET_TEAR_OFF        = 0x34,
    MIPI_DCS_SET_TEAR_ON        = 0x35,
    MIPI_DCS_SET_ADDRESS_MODE    = 0x36,
    MIPI_DCS_SET_SCROLL_START    = 0x37,
    MIPI_DCS_EXIT_IDLE_MODE        = 0x38,
    MIPI_DCS_ENTER_IDLE_MODE    = 0x39,
    MIPI_DCS_SET_PIXEL_FORMAT    = 0x3A,
    MIPI_DCS_WRITE_MEMORY_CONTINUE    = 0x3C,
    MIPI_DCS_SET_3D_CONTROL        = 0x3D,
    MIPI_DCS_READ_MEMORY_CONTINUE    = 0x3E,
    MIPI_DCS_GET_3D_CONTROL        = 0x3F,
    MIPI_DCS_SET_VSYNC_TIMING    = 0x40,
    MIPI_DCS_SET_TEAR_SCANLINE    = 0x44,
    MIPI_DCS_GET_SCANLINE        = 0x45,
    MIPI_DCS_SET_DISPLAY_BRIGHTNESS = 0x51,        /* MIPI DCS 1.3 */
    MIPI_DCS_GET_DISPLAY_BRIGHTNESS = 0x52,        /* MIPI DCS 1.3 */
    MIPI_DCS_WRITE_CONTROL_DISPLAY  = 0x53,        /* MIPI DCS 1.3 */
    MIPI_DCS_GET_CONTROL_DISPLAY    = 0x54,        /* MIPI DCS 1.3 */
    MIPI_DCS_WRITE_POWER_SAVE    = 0x55,        /* MIPI DCS 1.3 */
    MIPI_DCS_GET_POWER_SAVE        = 0x56,        /* MIPI DCS 1.3 */
    MIPI_DCS_SET_CABC_MIN_BRIGHTNESS = 0x5E,    /* MIPI DCS 1.3 */
    MIPI_DCS_GET_CABC_MIN_BRIGHTNESS = 0x5F,    /* MIPI DCS 1.3 */
    MIPI_DCS_READ_DDB_START        = 0xA1,
    MIPI_DCS_READ_PPS_START        = 0xA2,
    MIPI_DCS_READ_DDB_CONTINUE    = 0xA8,
    MIPI_DCS_READ_PPS_CONTINUE    = 0xA9,
} cy_en_mipidsi_dcs_cmd_type_t;

/** MIPI DSI mode of operation */
typedef enum
{
    DSI_VIDEO_MODE,
    DSI_COMMAND_MODE
} cy_en_mipidsi_mode_t;

/** MIPI DSI transfer mode */
typedef enum
{
    DSI_LP_MODE,
    DSI_HS_MODE
} cy_en_mipi_dsi_transfer_mode;


/** \} group_mipidsi_enums */


/*******************************************************************************
*      Types definition
*******************************************************************************/

/**
* \addtogroup group_mipidsi_data_structures
* \{
*/

/** MIPI DSI Display params. */
typedef struct
{
    uint32_t pixel_clock;     /**< Pixel clock in kHz */
    uint16_t hdisplay;        /**< Display size in horizontal direction */
    uint16_t hsync_width;     /**< Hsync Width */
    uint16_t hfp;             /**< Hsync end position */
    uint16_t hbp;             /**< Horizontal Total */
    uint16_t vdisplay;        /**< Display size in vertical direction */
    uint16_t vsync_width;     /**< VSync Width */
    uint16_t vfp;             /**< Vertical Front Porch */
    uint16_t vbp;             /**< Vertical Back Porch */
    uint32_t polarity_flags;  /**< Polarity flags */
} cy_stc_mipidsi_display_params_t;

/** MIPI DSI Block Configuration */
typedef struct
{
    uint32_t                          virtual_ch;             /**< Display controller configuration */
    uint32_t                          num_of_lanes;           /**< GPU configuration is optional */
    uint32_t                          per_lane_mbps;          /**< per lane speed in mbps */
    cy_en_mipidsi_pixel_format_t      dpi_fmt;                /**< MIPI DSI configuration */
    uint32_t                          max_phy_clk;            /**< device max DPHY clock in MHz unit */
    cy_en_mipidsi_mode_t              dsi_mode;               /**< Command mode/Video mode */
    uint32_t                          mode_flags;             /**< Additional mode information */
    cy_stc_mipidsi_display_params_t   *display_params;        /**< Display parameters */
} cy_stc_mipidsi_config_t;

