PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_mipidsi.h
/** MIPI DSI internal context data. The user must not modify it. */
typedef struct
{
    /** \cond INTERNAL */

    uint32_t                          virtual_ch;             /**< Display controller configuration */
    uint32_t                          num_of_lanes;           /**< GPU configuration is optional */
    uint32_t                          per_lane_mbps;          /**< per lane speed in mbps */
    cy_en_mipidsi_pixel_format_t      dpi_fmt;                /**< MIPI DSI configuration */
    uint32_t                          max_phy_clk;            /**< device max DPHY clock in MHz unit */
    cy_en_mipidsi_mode_t              dsi_mode;               /**< Command mode/Video mode */
    uint32_t                          mode_flags;             /**< Additional mode information */
    cy_stc_mipidsi_display_params_t   display_params;         /**< Display parameters */
    bool                              enable;                  /**< Dsi enable state*/

    /** \endcond */
} cy_stc_mipidsi_context_t;

/** \} group_mipidsi_data_structures */


/*******************************************************************************
*    Function Prototypes
*******************************************************************************/
/**
* \addtogroup group_mipidsi_functions
* \{
*/

/*******************************************************************************
* Function Name: Cy_MIPIDSI_Init
****************************************************************************//**
*
* Initializes MIPI DSI IP Block.
*
* \param base
* Pointer to the MIPI DSI register base address.
*
* \param config
* Pointer to the configuration structure.
*
* \param context
* context information used by the driver.
*
* \return
* Initialization status.
*
*******************************************************************************/
cy_en_mipidsi_status_t  Cy_MIPIDSI_Init(GFXSS_MIPIDSI_Type *base, cy_stc_mipidsi_config_t const *config, cy_stc_mipidsi_context_t *context);

/*******************************************************************************
* Function Name: Cy_MIPIDSI_Enable
****************************************************************************//**
*
* Enables MIPI DSI IP Block.
*
* \param base
* Pointer to the MIPI DSI register base address.
*
*******************************************************************************/
void Cy_MIPIDSI_Enable(GFXSS_MIPIDSI_Type *base);

/*******************************************************************************
* Function Name: Cy_MIPIDSI_Disable
****************************************************************************//**
*
* Disable MIPI DSI IP Block.
*
* \param base
* Pointer to the MIPI DSI register base address.
*
*******************************************************************************/
void Cy_MIPIDSI_Disable(GFXSS_MIPIDSI_Type *base);

/*******************************************************************************
* Function Name: Cy_MIPIDSI_DeInit
****************************************************************************//**
*
* DeInitializes MIPI DSI IP Block resources.
*
* \param base
* Pointer to the MIPI DSI register base address.
*
*******************************************************************************/
void Cy_MIPIDSI_DeInit(GFXSS_MIPIDSI_Type *base);

/*******************************************************************************
* Function Name: Cy_MIPIDSI_SetInterruptMask
****************************************************************************//**
*
* Set interrupt mask for MIPI DSI Block
*
* \param base
* Pointer to the MIPI DSI register base address.
*
* \param interrupt_mask
* interrupt mask containing the list of interrupts to be notified.
*
* See \ref group_mipidsi_intr_mask_macros for the set of constants.
*******************************************************************************/
void  Cy_MIPIDSI_SetInterruptMask(GFXSS_MIPIDSI_Type *base, uint32_t interrupt_mask);

/*******************************************************************************
* Function Name: Cy_MIPIDSI_GetInterruptMask
****************************************************************************//**
*
* Get MIPI DSI Block interrupt mask
*
* \param base
* Pointer to the MIPI DSI register base address.
*
* \return
* interrupt mask.
*
* See \ref group_mipidsi_intr_mask_macros for the set of constants.
*******************************************************************************/
uint32_t  Cy_MIPIDSI_GetInterruptMask(GFXSS_MIPIDSI_Type const *base);

/*******************************************************************************
* Function Name: Cy_MIPIDSI_GetInterruptStatusMasked
****************************************************************************//**
*
* Get interrupt status
*
* \param base
* Pointer to the MIPI DSI register base address.
*
* \return
* interrupt status
*
* See \ref group_mipidsi_intr_mask_macros for the set of constants.
*******************************************************************************/
uint32_t  Cy_MIPIDSI_GetInterruptStatusMasked(GFXSS_MIPIDSI_Type const *base);

/*******************************************************************************
* Function Name: Cy_MIPIDSI_WritePacket
****************************************************************************//**
*
* Writes DCS packet on DSI interface.
*
* \param base
* Pointer to the MIPI DSI register base address.
*
* \param buf
* buffer containing the packet.
*
* \param length
* length of the packet.
*
* \return
* packet write status.
*
*******************************************************************************/
cy_en_mipidsi_status_t Cy_MIPIDSI_WritePacket(GFXSS_MIPIDSI_Type *base, const uint8_t *buf, uint32_t length);

/*******************************************************************************
* Function Name: Cy_MIPIDSI_GenericWritePacket
****************************************************************************//**
*
* Writes Generic packet on DSI interface.
*
* \param base
* Pointer to the MIPI DSI register base address.
*
* \param buf
* buffer containing the packet.
*
* \param length
* length of the packet.
*
* \return
* packet write status.
*
*******************************************************************************/
cy_en_mipidsi_status_t Cy_MIPIDSI_GenericWritePacket(GFXSS_MIPIDSI_Type *base, const uint8_t *buf, uint32_t length);

