PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_mipidsi.h
/*******************************************************************************
* Function Name: Cy_MIPIDSI_ReadPacket
****************************************************************************//**
*
* Read packet from DSI
*
* \param base
* Pointer to the MIPI DSI register base address.
*
* \param packet_type
* Packet type either short or long packet.
*
* \param buf
* pointer to the output buffer read from the interface.
*
* \param length
* length of the packet.
*
* \return
* packet read status.
*
*******************************************************************************/
cy_en_mipidsi_status_t Cy_MIPIDSI_ReadPacket(GFXSS_MIPIDSI_Type *base, cy_en_mipidsi_packet_type_t packet_type, uint32_t *buf, uint32_t length);

/*******************************************************************************
* Function Name: Cy_MIPIDSI_EnterSleep
****************************************************************************//**
*
* Sends MIPI DSI DCS Command MIPI_DCS_ENTER_SLEEP_MODE.
*
* \param base
* Pointer to the MIPI DSI register base address.
*
* \return
* Command transfer status.
*
*******************************************************************************/
cy_en_mipidsi_status_t Cy_MIPIDSI_EnterSleep(GFXSS_MIPIDSI_Type *base);

/*******************************************************************************
* Function Name: Cy_MIPIDSI_ExitSleep
****************************************************************************//**
*
* Sends MIPI DSI DCS Command MIPI_DCS_EXIT_SLEEP_MODE.
*
* \param base
* Pointer to the MIPI DSI register base address.
*
* \return
* Command transfer status.
*******************************************************************************/
cy_en_mipidsi_status_t Cy_MIPIDSI_ExitSleep(GFXSS_MIPIDSI_Type *base);

/*******************************************************************************
* Function Name: Cy_MIPIDSI_SoftReset
****************************************************************************//**
*
* Sends MIPI DSI DCS Command MIPI_DCS_SOFT_RESET.
*
* \param base
* Pointer to the MIPI DSI register base address.
*
* \return
* Command transfer status.
*******************************************************************************/
cy_en_mipidsi_status_t Cy_MIPIDSI_SoftReset(GFXSS_MIPIDSI_Type *base);

/*******************************************************************************
* Function Name: Cy_MIPIDSI_DisplayON
****************************************************************************//**
*
* Sends MIPI DSI DCS Command MIPI_DCS_SET_DISPLAY_ON.
*
* \param base
* Pointer to the MIPI DSI register base address.
*
* \return
* Command transfer status.
*******************************************************************************/
cy_en_mipidsi_status_t Cy_MIPIDSI_DisplayON(GFXSS_MIPIDSI_Type *base);

/*******************************************************************************
* Function Name: Cy_MIPIDSI_DisplayOFF
****************************************************************************//**
*
* Sends MIPI DSI DCS Command MIPI_DCS_SET_DISPLAY_OFF.
*
* \param base
* Pointer to the MIPI DSI register base address.
*
* \return
* Command transfer status.
*******************************************************************************/
cy_en_mipidsi_status_t Cy_MIPIDSI_DisplayOFF(GFXSS_MIPIDSI_Type *base);

/*******************************************************************************
* Function Name: Cy_MIPIDSI_EnterULPM
****************************************************************************//**
*
* Enter Ultra Low Power Mode for both clock and data lines
*
* \param base
* Pointer to the MIPI DSI register base address.
*
* \return
* Status of the operation.
*******************************************************************************/
cy_en_mipidsi_status_t Cy_MIPIDSI_EnterULPM(GFXSS_MIPIDSI_Type *base);

/*******************************************************************************
* Function Name: Cy_MIPIDSI_ExitULPM
****************************************************************************//**
*
* Exit Ultra Low Power Mode for both clock and data lines
*
* \param base
* Pointer to the MIPI DSI register base address.
*
* \return
* Status of the operation.
*******************************************************************************/
cy_en_mipidsi_status_t Cy_MIPIDSI_ExitULPM(GFXSS_MIPIDSI_Type *base);

/*******************************************************************************
* Function Name: Cy_MIPIDSI_EnterULPM_Data
****************************************************************************//**
*
* Enter Ultra Low Power Mode for data lines
*
* \param base
* Pointer to the MIPI DSI register base address.
*
* \return
* Status of the operation.
*******************************************************************************/
cy_en_mipidsi_status_t Cy_MIPIDSI_EnterULPM_Data(GFXSS_MIPIDSI_Type *base);

/*******************************************************************************
* Function Name: Cy_MIPIDSI_ExitULPM_Data
****************************************************************************//**
*
* Exit Ultra Low Power Mode for data lines
*
* \param base
* Pointer to the MIPI DSI register base address.
*
* \return
* Status of the operation.
*******************************************************************************/
cy_en_mipidsi_status_t Cy_MIPIDSI_ExitULPM_Data(GFXSS_MIPIDSI_Type *base);

/** \} group_mipidsi_functions */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS22MIPI DSI */

#endif /* CY_GRAPHICS_H */

/** \} group_mipidsi */

/* [] END OF FILE */
